package Courses.JavaRush.Level03;
/**  15.12.2019
 *
 *  Вывести на экран десять раз надпись
«Я хочу изучать Java и получать большую зарплату»
*/
public class Lesson12Home2 {
    public static void main(String[] args) {
        int i=0;
        while(i<10) {
            System.out.println(i+" «Я хочу изучать Java и получать большую зарплату»");
        i++;
        }
        }
}
