package сourses.javaRush.Level04;
/** 18.01.2020
 *  S-квадрат
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
*/
public class Lesson10Task04 {
    public static void main(String[] args) {
       int i = 0;
        while (i < 10){
            System.out.println("SSSSSSSSSS");
            i++;
        }
    }
}
